# EditScope Methods

---
The EditScope type exposes the following members.
| Name| Description
---|---|---
| Cancel|  Cancels the edit scope.
| Commit|  Finishes the edit scope.
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
EditScope Class
Autodesk.Revit.DB Namespace